import 'package:flutter/material.dart';

import 'package:epilepsy/views/infor/components/infor_card_view.dart';

class InforView extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Container(
      alignment: Alignment.topLeft,
      padding: EdgeInsets.fromLTRB(20, 48, 20, 0),
      child: Column(
        crossAxisAlignment: CrossAxisAlignment.start,
        mainAxisSize: MainAxisSize.max,
        mainAxisAlignment: MainAxisAlignment.start,
        children: <Widget>[
          Row(
            children: [
              Image.asset(
                'assets/images/epilepsy-logo.jpg',
                  width: 320, height: 140
              ),
            ],
          ),
          Expanded(
              child: ListView(
            children: [
              InforCardView(
                  'โรคลมชักคืออะไร?',
                  'รู้จักโรคลมชักแบบตในแบบต่างๆ',
                  'assets/images/what_is_epilepsy.jpg',
                  'อาการชัก คือ อาการที่เกิดจากภาวะที่เซลล์ประสาทมีการทำงานที่ผิดปกติอย่างเฉียบพลัน โดยมีการสร้างกระแสไฟฟ้ามากเกินปกติ อาการชักเกิดได้จากหลายสาเหตุ และผู้ป่วยที่มีอาการชักไม่จำเป็นต้องเป็นโรคลมชักเสมอไป เช่น ผู้ป่วยที่มีอาการชักจากภาวะน้ำตาลต่ำ จากยาบางชนิด หรือภาวะไข้สูงในเด็ก  ซึ่งจัดเป็นการชักที่มีปัจจัยกระตุ้น โดยคนไข้จะไม่มีอาการชักอีก ถ้าปัจจัยชักนำเหล่านี้ได้รับการแก้ไข โรคลมชัก คือภาวะที่ผู้ป่วยมีอการชักซ้ำโดยที่ไม่มีปัจจัยกระตุ้น         ( Provoked factors ) อาจจะพบพยาธิสภาพในสมองหรือไม่ก็ได้ ในกรณีผู้ป่วยชักครั้งแรกร่วมกับมีคลื่นสมองผิดปกติแบบ ที่เป็นคลื่นชัก (epileptiform discharge) หรือมีรอยโรคในสมอง จะมีโอกาสชักซ้ำสูง การวินิจฉัยโรคลมชักใช้คำจำกัดความของโรคลมชักดังต่อไปนี้ 1.	 อาการชักโดยที่ไม่มีปัจจัยกระตุ้นตั้งแต่ 2 ครั้งขึ้นไป โดยอาการชัก 2 ครั้งนั้นต้องมีระยะเวลาห่างกันตั้งแต่ 24 ชั่วโมง ขึ้นไป 2.	 อาการชักที่เกิดขึ้นเพียงครั้งเดียว โดยที่ไม่มีปัจจัยกระตุ้นในผู้ป่วยที่มีโอกาสเสี่ยงสูงที่จะมีอาการชักซ้ำโดยความเสี่ยงเท่ากับผู้ป่วยที่มีอาการชักโดยที่ไม่มีปัจจัยกระตุ้นตั้งแต่2ครั้งขึ้นไปกล่าวคือผู้ป่วยมีโอกาสเกิดอาการชักซ้ำภายในระยะเวลา 10 ปีอย่างน้อยร้อยละ 60 3.	 กลุ่มอาการโรคลมชัก (epileptic syndrome) ชนิดต่างๆเช่นภาวะชักชนิดเหม่อ (absence) เป็นต้น จากคำนิยามใหม่ข้างต้นเห็นได้ว่าในผู้ป่วยที่มีอาการชักโดยไม่มีปัจจัยกระตุ้นเพียงครั้งเดียวจะได้รับการวินิจฉัยว่าเป็นโรคลมชัก เมื่อผู้ป่วยมี ความเสี่ยงสูงที่จะมีอาการชักซ้ำ เช่น อาการชักครั้งแรกในผู้ป่วยที่มีโรคสมองผิดรูปและมีคลื่นสมองที่ผิดปรกติเป็นแบบคลื่นชัก(epileptiform discharge)'),
              InforCardView(
                  'สาเหตุของการชัก',
                  'เรียนรู้สาเหตุของการเกิดอาการในแบบต่างๆ',
                  'assets/images/cause-epilepsy.png',
                  'ประเภทของอาการชัก ในปีพ.ศ. 2553 สมาพันธ์ต่อต้านโรคลมชักนานาชาติ(International League Against Epilepsy, ILAE)  ได้มีการทบทวนและ เปลี่ยนแปลงคำจำกัดความและการจำแนกชนิด ของอาการชัก โดยจำแนกเป็น 3 ชนิด  ได้แก่ อาการชักเฉพาะที่ (focal seizure) คือ อาการชักที่เกิดจากการเปลี่ยนแปลงของคลื่นไฟฟ้าสมองของสมองเพียงซีกเดียวหรือสมองเพียงบางจุด โดยคลื่นสมองที่ผิดปกติอาจมีความผิดปกติอยู่เฉพาะที่หรือกระจายไปยังบริเวณอื่นๆของสมอง หลังจากนั้น โดยจำแนกอาการชักแบบเฉพาะที่เป็น 3 ชนิดย่อยดังนี้ -อาการชักเฉพาะที่โดยผู้ป่วยรู้สึกตัวดี ร่วมกับมีอาการอย่างน้อย1ข้อได้แก่อาการเตือน (aura) อาการชักเกร็งส่วนใดส่วนหนึ่งของร่างกาย และอาการทางระบบประสาทอัตโนมัติ(focal seizure with observable motor or autonomic components)  	 -	 อาการชักเฉพาะที่โดยผู้ป่วยไม่รู้สึกตัว (focal seizure with impairment of consciousness or awareness)  	 -	 อาการชักเฉพาะที่ตามด้วยอาการชักเกร็ง หรือชักกระตุก หรือชักเกร็งกระตุกทั้งตัว(focal seizure evolving to a bilateral, convulsive seizure evolving to tonic, clonic, or tonic and clonic  components) 2.	อาการชักจากสมองทุกส่วน (Generalized seizure)  คืออาการชักที่เกิดจากการเปลี่ยนแปลงของคลื่นไฟฟ้าสมองทั้ง 2 ซีกตั้งแต่เริ่มต้นของการชัก	 มีชนิดของอาการชักที่ พบได้บ่อยได้แก่อาการชักแบบเหม่อ(Absence seizure) อาการชักสะดุ้ง (myoclonic seizure)  และอาการชักชนิดตัวอ่อน (Atonic seizure ) 3.	อาการชักที่ไม่สามารถจำแนกชนิดได้ชัดเจน คืออาการชักที่ไม่สามารถจำแนกเข้า กับอาการชัก2 ชนิดแรกได้แก่อาการชักแบบผวา (epileptic spasms) เป็นต้น เหตุที่ใช้คำว่า epileptic spasms ไม่ใช้คำว่า infantile spasms เนื่องจาก อาการชักแบบผวาสามารถพบได้ในผู้ป่วยที่มีอายุ มากกว่า 1ปี'),
              InforCardView(
                  'ประเภทของอาการชัก',
                  'เรียนรู้ประเภทของการชักในแบบต่างๆ',
                  'assets/images/type_of_epilepsy.gif',
                  'สาเหตุของโรคลมชักเกิดจากภาวะใดๆก็ตามที่ก่อให้เกิดรอยโรคในสมอง เช่น อุบัติเหตุ , การติดเชื้อในสมอง,นื้องอก และ ความผิดปกติของสมองแต่กำเนิดเป็นต้น อย่างไรก็ดี การชักในเด็กส่วนใหญ่ โดยเฉพาะ เด็กที่มีพัฒนาการปกติมักตรวจไม่พบความผิดปกติของสมองใดๆ จากการตรวจทางรังษีวินิจฉัย การตรวจวินิจฉัย การวินิจฉัยโรคลมชักเพื่อให้ทราบถึงสาเหตุที่แท้จริงมีความสำคัญ เพราะทำให้ได้การรักษาที่มีประสิทธิภาพ นอกจากแพทย์จะทำการซักประวัติอย่างละเอียดแล้ว ยังมีเครื่องมือที่ทันสมัย เพื่อช่วยยืนยันการวินิจฉัยเช่น การตรวจคลื่นไฟฟ้าสมอง (EEG) ช่วยวินิจฉัยโรคลมชัก และทำให้สามารถบอกตำแหน่งของสมองที่เกิดการชักและชนิดของการชักได้ การตรวจเอกซเรย์คอมพิวเตอร์ (CT Scan) และการทำเอ็มอาร์ไอ (MRI)  ช่วยให้แพทย์เห็นภาพความผิดปกติของสมองที่เป็นสาเหตุของโรคลมชักได้ '),
              InforCardView(
                  'การรักษาโรคลมชัก',
                  'เรียนรู้การรักษาโรคลมชักในแบบต่างๆ',
                  'assets/images/rescure_of_epilepsy.jpg',
                  '1.การใช้ยากันชัก โดยทั่วไปเป็นระยะเวลาที่ผู้ป่วยไม่มีอาการชักติดต่อกันอย่างน้อย 2 ปีหรือนานกว่านั้น และการรักษาสาเหตุของการเกิดโรคลมชักนั้นๆ ผู้ป่วยส่วนใหญ่สามารถรักษาจนหายขาดได้ แต่ในบางรายทำได้เพียงแค่ยับยั้งไม่ให้เกิดอาการชักโดยรับประทานยาควบคุมอย่างต่อเนื่องและมีบางรายที่การชักไม่สมามารถถูกควบคุมจากการใช้ยากันชัก และมีความจำเป็นต้องพิจารณาการรักษาวิธีอื่น เช่น การผ่าตัด การใช้เครื่องกระตุ้นส้นประสาทสมองคู่ที่ 10 การให้อาหารคีโตน เป็นต้น ในปัจจุบันยากันชักมีอยู่หลายชนิด ซึ่งมีความปลอดภัยและมีประสิทธิภาพในการควบคุมอาการชัก วิธีการปฐมพยาบาล ผู้ป่วยขณะชัก 1. ถอดแว่นตา คลายกระดุม ที่คอเสื้อ คลายเข็มขัดที่กางเกงหรือกระโปรง 2. จับนอนตะแคงบนพื้นหรือบนเตียงห่างจากสิ่งอันตรายต่างๆ และหันศีรษะไปด้านใดด้านหนึ่งเพื่อป้องกันการสำลักและลิ้นตกไปอุดกั้นทางเดินหายใจ ดังรูป 3. ห้ามงัดปากหรือสอดใส่วัตถุใดๆ ในช่องปากขณะชัก เพราะอาจจะทำให้ฟันหัก หรือสำลัก และเกิดอันตรายได้ 4. ห้ามกรอกยาขณะชัก เพราะอาจทำให้สำลักได้ 5. ห้ามจับมัดหรือตรึง เพราะอาจทำให้ชักมากขึ้นหรือนานขึ้น และอาจทำให้เกิดการฟกช้ำหรือกระดูกหักได้ 6. เฝ้าสังเกตอาการผู้ป่วยขณะชัก และจับเวลาที่เกิดอาการชัก หรืออาจใช้การบันทึกภาพวิดีโอ ตามปกติผู้ป่วยลมชักจะมีอาการสงบลงได้เองเมื่อผ่านไป 2-3 นาที หากมีอาการชักเกิน 5 นาทีควรรีบส่งแพทย์ 7. ถ้าอาการดีขึ้นและมียากันชักกินอยู่แล้ว ควรรีบปรึกษาหมอเรื่องการปรับยาใหม่ ไม่ควรเพิ่มยาเอง '),
            ],
          ))
        ],
      ),
    );
  }
}
